<?php

use Illuminate\Database\Seeder;

class UserCareerTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run() 

    { 

         $data = [ 

1,'EC','マーケティング','マネージャー','2014','2017','最初に配属されたのは、楽天市場の顧客戦略を担う部署です。ここは楽天のキャラクターである「お買いものパンダ」を用いたブランディングも行っていますが、私は楽天市場をより使いやすくするためのナビゲーション、特にカテゴリー構造を最適化するためのプロジェクトに１年ほど携わっていました。',
1,'EC','営業・コンサルタント',null,'2012','2014',null,
2,'EC','営業・コンサルタント','ディレクター','2010','2018','楽天の主力事業「楽天市場」のECコンサルタントとして、フード&ドリンク事業課に所属し、過去には東京と北日本、関西、東海エリアの店舗様に足を運び、売上を伸ばすお手伝いをしていました。',
3,'EC','営業・コンサルタント','マネージャー','2014','2018','西日本エリアの統括',
3,'その他','戦略・経営企画',null,'2012','2014','数名のECCとテストプロジェクトを立ち上げました。彼らの日常的なタレントマネジメントや仕事の進め方を学び、改善を見込める点についていくつかのアイデアを試しました。',
3,'EC','営業・コンサルタント',null,'2008','2012',null,
4,'EC','物流・SCM','リーダー','2000','2001',null,
5,'EC','アプリケーションエンジニア',null,'2011','2018','一つはユーザーが求める商品をより見つけやすくするためのUIやUXの改善、もう一つは「楽天市場」に出店している店舗向けのマーティングツールおよびサービスの開発',
6,'EC','データサイエンティスト・リサーチャー','マネージャー','2005','2015',null,
7,'EC','その他','ディレクター','2003','2004','「楽天市場」など当社が所有するメディア資産を活用し、一般企業（クライアント）に広告ソリューションを提供',
8,'その他','営業・コンサルタント','プロデューサー','2013','2018',null,
8,'EC','マーケティング',null,'2009','2013',null,
9,'EC','営業・コンサルタント','リーダー','2005','2006',null,
10,'EC','戦略・経営企画','リーダー','2010','2018','数名のECCとテストプロジェクトを立ち上げました。彼らの日常的なタレントマネジメントや仕事の進め方を学び、改善を見込める点についていくつかのアイデアを試しました。',
10,'EC','戦略・経営企画',null,'2006','2010',null,
11,'EC','物流・SCM','マネージャー','2007','2008',null,
12,'その他','アプリケーションエンジニア','ディレクター','2007','2009',null,
13,'EC','データサイエンティスト・リサーチャー','プロデューサー','2009','2010',null,
14,'EC','その他','リーダー','2010','2011',null,
15,'トラベル','マーケティング','リーダー','2015','2018','トラベルコやトラベルjp、トリップアドバイザー、大きい所ではJALやANAなどのパートナーサイトと一緒に 共同キャンペーンを組んだり、アフィリエイト連携',
15,'トラベル','マーケティング',null,'2013','2015','航空系サイトやメタサーチサイト、福利厚生サイトなどの外部パートナーや媒体と連携し「楽天トラベル」へ集客',
15,'トラベル','営業・コンサルタント','マネージャー','2008','2013','旅行サービスの手配・運用、システムやウェブサイトなどのマネジメント業務全般',
16,'その他','営業・コンサルタント','マネージャー','2013','2015','西日本エリアの統括',
17,'トラベル','戦略・経営企画','ディレクター','2013','2014','事業のマネージャーとして仕入れやプロダクト開発、システム改善、ウェブマーケティングなどをリード',
17,'その他','営業・コンサルタント','null','2008','2013',null,
18,'トラベル','アプリケーションエンジニア','プロデューサー','2014','2015','一つはユーザーが求める商品をより見つけやすくするためのUIやUXの改善、もう一つは「楽天トラベル」に出店しているホテル様向けのマーティングツールおよびサービスの開発',
19,'トラベル','アプリケーションエンジニア','リーダー','2015','2016','一つはユーザーが求める商品をより見つけやすくするためのUIやUXの改善、もう一つは「楽天トラベル」に出店しているホテル様向けのマーティングツールおよびサービスの開発',
20,'トラベル','戦略・経営企画','リーダー','2015','2018','数名のメンバーとテストプロジェクトを立ち上げました。彼らの日常的なタレントマネジメントや仕事の進め方を学び、改善を見込める点についていくつかのアイデアを試しました。',
20,'トラベル','データサイエンティスト・リサーチャー',null,'2012','2015','データサイエンスの視点から、楽天における膨大な「データ」というツールを最大限に活用し、様々な方法でより良いサービスを実現するためのソリューションを提供',
21,'トラベル','その他','マネージャー','2010','2018',null,
22,'その他','マーケティング','ディレクター','1997','1998','トラベルコやトラベルjp、トリップアドバイザー、大きい所ではJALやANAなどのパートナーサイトと一緒に 共同キャンペーンを組んだり、アフィリエイト連携',
23,'トラベル','営業・コンサルタント','マネージャー','1998','1999',null,
24,'トラベル','戦略・経営企画','リーダー','1999','2000','旅行会社向けに、手配オペレーションや業務プロセス設計などを担当',
25,'その他','物流・SCM',null,'2000','2001',null,
26,'トラベル','アプリケーションエンジニア','プロデューサー','2009','2018',null,
27,'トラベル','データサイエンティスト・リサーチャー','ディレクター','2007','2018',null,
28,'トラベル','その他','プロデューサー','2003','2004',null,
29,'FinTech','マーケティング','リーダー','2004','2005','楽天スーパーポイントをフックにしたユーザー参加型のキャンペーンを展開',
30,'FinTech','営業・コンサルタント',null,'2005','2006','多くの中小企業に向けて、投資関連の営業を、中部地方を中心に担当',
30,'FinTech','マーケティング','リーダー','2006','2006','バナー広告を使用したwebマーケを中心に、トラベルページへの集客を担当',
31,'FinTech','マーケティング','マネージャー','2006','2007','マネージャーとして、50人規模のマーケティングチームのマネジメントを担当',
31,'FinTech','戦略・経営企画','マネージャー','2008','2012','会社の幹部レベルの数名と、FinTech事業の拡大に向けたプロジェクトを推進した',
32,'その他','戦略・経営企画','ディレクター','2007','2008','FinTech関連の大幅な戦略変更に伴ったプロジェクトで、買収後の金融会社の戦略・方向性の決定を担当した',
32,'FinTech','営業・コンサルタント','プロデューサー','2009','2015','主に九州地方の営業部隊の統括を担当。非効率な電話営業での勧誘を、システムを導入することで、自動化に成功した',
33,'FinTech','アプリケーションエンジニア','プロデューサー','2008','2009','社内向けシステムのサーバーサイドのエンジニアとして、アプリ作成を担当',
33,'その他','アプリケーションエンジニア','マネージャー','2010','2017','社内向けシステムを作るエンジニアの統括を主に担当',
34,'FinTech','データサイエンティスト・リサーチャー','リーダー','2009','2010','ユーザーにはより使いやすいUIやUXを、店舗には売上増につながる有意義なソリューション・サービスの提供など、楽天の未来を創造していくために欠かせない業務を担当',
34,'FinTech','戦略・経営企画','マネージャー','2011','2013','データ解析を用いた企業戦略の方向性決定を担当',
35,'その他','その他',null,'2010','2011','経理部門として、日々の支出計算の管理を担当。また、決算前後の期間では、決算報告資料の元データの編集も行った。',
35,'FinTech','マーケティング','リーダー','2012','2014','最初に配属されたのは、楽天銀行の顧客戦略を担う部署です。ここは楽天のキャラクターである「お買いものパンダ」を用いたブランディングも行っていますが、私はをより楽天銀行を使いやすくするためのナビゲーション、特にカテゴリー構造を最適化するためのプロジェクトに１年ほど携わっていました。',
36,'FinTech','マーケティング','マネージャー','2011','2012','楽天Payのバナー広告・アフィリエイト広告の運営を主に担当していました。また、オフライン広告の運営を行うチームの統括も行っていました。',
36,'FinTech','営業・コンサルタント','リーダー','2013','2018','関東地方の営業リーダーとして、主に大企業に向けた営業部門の統括を担当',
37,'FinTech','営業・コンサルタント','ディレクター','2012','2013','主に、中小企業に向けた投資関連のGET業務を担当',
37,'FinTech','マーケティング','プロデューサー','2014','2017','マーケティング部は、楽天いPayに興味を持っていただけるよう、オンラインメディアを通じて様々な情報発信をする部署を担当',
38,'FinTech','戦略・経営企画','プロデューサー','2013','2014','顧客満足度や従業員満足度、品質管理（バックオフィス、コールセンター）などの情報を総合的に判断し、サービス運用の課題を解決する、というこれまで培ってきたスキルを楽天のために役立てたいと考え、具体的なKaizenプランを提案することにしました。',
38,'FinTech','戦略・経営企画','マネージャー','2015','2018','顧客満足の向上を目的とした、FinTech事業を横断したブランディング戦略を担当しました',
39,'FinTech','物流・SCM','リーダー','2014','2015',null,
39,'FinTech','営業・コンサルタント','プロデューサー','2016','2018',null,
40,'FinTech','アプリケーションエンジニア',null,'2015','2016',null,
40,'FinTech','アプリケーションエンジニア','リーダー','2017','2018',null,
41,'FinTech','データサイエンティスト・リサーチャー','マネージャー','2016','2017','リコメンドロジック等のデータサイエンスソリューションの開発に従事',
41,'FinTech','営業・コンサルタント','マネージャー','2017','2018',null,
42,'FinTech','その他','ディレクター','2017','2018',null,
43,'新サービス','マーケティング','プロデューサー','2005','2015','マリッジ事業部では、楽天オーネットという結婚情報サービスのマーケティングを担当しています。楽天オーネットでは、お客様が良いお相手を見つけ、ご結婚いただくことを目指しています。',
44,'その他','営業・コンサルタント','リーダー','1998','1999',null,
45,'新サービス','戦略・経営企画',null,'1999','2003','大まかに2つの役割を担っていました。1つはMCO（メディア＆コミュニケーションズカンパニー）における事業開発と、もう1つはCEO戦略・イノベーション室（CEIO）の一員としての業務です。',
45,'EC','アプリケーションエンジニア','マネージャー','2003','2018','一つはユーザーが求める商品をより見つけやすくするためのUIやUXの改善、もう一つは「楽天市場」に出店している店舗向けのマーティングツールおよびサービスの開発',
46,'新サービス','物流・SCM','マネージャー','2000','2001',null,
47,'新サービス','アプリケーションエンジニア','ディレクター','2001','2002','結婚式場探しのサービス「楽天ウェディング」と、フォトウェディングサービス「Picmarry」の開発に関わり、プロダクトマネジメントとプロジェクトマネジメントの両方を担当しています。',
47,'FinTech','物流・SCM','プロデューサー','1999','2001','顧客満足度や従業員満足度、生産性、品質管理（バックオフィス、コールセンター、小売店舗）などの情報を総合的に判断し、サービス運用の課題を解決する、というこれまで培ってきたスキルを楽天のために役立てたいと考え、具体的なKaizenプランを提案することにしました。',
48,'その他','データサイエンティスト・リサーチャー','プロデューサー','2002','2003',null,
49,'新サービス','その他','リーダー','2003','2004',null,
50,'新サービス','マーケティング','ディレクター','2010','2018','マーケティング部は、楽天オーネットに興味を持っていただけるよう、オンラインメディアを通じて様々な情報発信をする部署です。',
50,'トラベル','マーケティング','リーダー','2005','2010','トラベルコやトラベルjp、トリップアドバイザー、大きい所ではJALやANAなどのパートナーサイトと一緒に 共同キャンペーンを組んだり、アフィリエイト連携',
51,'新サービス','営業・コンサルタント','マネージャー','2005','2006',null,
52,'その他','戦略・経営企画','ディレクター','2006','2007','結婚式の前撮りに関するサービスを立案する機会をいただき、実現させることができました。イチから画面の仕様や機能、必要な特徴を洗い出し、約3カ月でサービスの立ち上げを行いました。',
53,'新サービス','物流・SCM','プロデューサー','2007','2008',null,
53,'RIT','戦略・経営企画','プロデューサー','2008','2015','顧客満足度や従業員満足度、生産性、品質管理（バックオフィス、コールセンター、小売店舗）などの情報を総合的に判断し、サービス運用の課題を解決する、というこれまで培ってきたスキルを楽天のために役立てたいと考え、具体的なKaizenプランを提案することにしました。',
54,'新サービス','アプリケーションエンジニア','リーダー','2015','2018',null,
55,'新サービス','データサイエンティスト・リサーチャー',null,'2009','2010',null,
56,'新サービス','その他','マネージャー','2010','2011',null,
57,'RIT','マーケティング','ディレクター','2011','2012',null,
58,'RIT','営業・コンサルタント','プロデューサー','2012','2013','研究案件のビジネス連携に注力する新規組織であるPMOグループに所属',
59,'RIT','戦略・経営企画','リーダー','2013','2014','エンドユーザー向けサービスのプロダクトマネジメントなどを経験後、人材・予算管理業務などを行う',
60,'その他','物流・SCM',null,'2014','2015',null,
61,'RIT','アプリケーションエンジニア','マネージャー','2015','2016','「楽天市場」の分析システムや、「楽天コミュニケーションズ」のネットワークをより快適に利用するための仕組み作りに加え、ハイパフォーマンスコンピューティングやロボット関連など、広範囲に渡る研究活動を行っています',
61,'コーポレート','戦略・経営企画','プロデューサー','2016','2018','企画部のミッションは、3年後の成長に向けて、経営課題を構想から実行までドライブすること。三木谷社長やECカンパニー経営陣と経営課題や解決策について議論させて頂き、その実現まで責任を持ってリードしていきます。',
61,'コーポレート','データサイエンティスト・リサーチャー','リーダー','2006','2015','リコメンドロジック等のデータサイエンスソリューションの開発に従事',
62,'その他','データサイエンティスト・リサーチャー','ディレクター','2016','2017',null,
63,'RIT','その他','プロデューサー','2010','2018','ビジネスと研究を連携させるコーディネート、個別のプロジェクトおよびプロダクトの管理、技術営業や実験のサポート、実験パートナーとの折衝など',
63,'新サービス','営業・コンサルタント','リーダー','2006','2010','西日本エリアの統括',
64,'その他','マーケティング','リーダー','1997','1998',null,
65,'RIT','営業・コンサルタント',null,'1998','1999',null,
66,'RIT','戦略・経営企画','マネージャー','2008','2016',null,
67,'RIT','物流・SCM','ディレクター','2012','2017',null,
68,'RIT','アプリケーションエンジニア','プロデューサー','2001','2002','音声入力やAR/VRに関するHCI（ヒューマンコンピューターインストラクション）や、AI（人工知能）やデザイン',
68,'トラベル','アプリケーションエンジニア','マネージャー','2002','2007','一つはユーザーが求める商品をより見つけやすくするためのUIやUXの改善、もう一つは「楽天トラベル」に出店しているホテル様向けのマーティングツールおよびサービスの開発',
69,'RIT','データサイエンティスト・リサーチャー','リーダー','2002','2003',null,
70,'RIT','その他',null,'2003','2004',null,
71,'コーポレート','マーケティング','マネージャー','2004','2005',null,
72,'その他','営業・コンサルタント','ディレクター','2005','2008',null,
73,'コーポレート','戦略・経営企画','プロデューサー','2006','2007','事業開発部は、企業の買収（M&A）やジョイントベンチャー投資、アライアンスを通じた楽天の成長戦略の立案・遂行を主なミッションとしています。',
73,'コーポレート','マーケティング','マネージャー','2002','2006','リサーチ統括部 総合調査グループにリサーチャーとして配属され、日本国内と海外の各種マーケティング調査を担当',
73,'RIT','マーケティング','ディレクター','2007','2011','事業部の戦略と照らし合わせながらセグメントに合わせたターゲティングや、リコメンドロジックの開発・改善など最もビジネス価値が高いソリューションを開発し、それを仕組み化するためシステムの実装まで行います。',
74,'コーポレート','物流・SCM','リーダー','2007','2008','顧客満足度や従業員満足度、生産性、品質管理（バックオフィス、コールセンター、小売店舗）などの情報を総合的に判断し、サービス運用の課題を解決する、というこれまで培ってきたスキルを楽天のために役立てたいと考え、具体的なKaizenプランを提案することにしました。',
75,'コーポレート','アプリケーションエンジニア',null,'2008','2009',null,
76,'コーポレート','データサイエンティスト・リサーチャー','マネージャー','2009','2010','楽天グループの多くのサービスによる「楽天経済圏」で得られる膨大なデータを活用したログデータの解析',
76,'FinTech','データサイエンティスト・リサーチャー','リーダー','2001','2010','ユーザーにはより使いやすいUIやUXを、店舗には売上増につながる有意義なソリューション・サービスの提供など、楽天の未来を創造していくために欠かせない業務を担当',
77,'コーポレート','その他','ディレクター','2010','2011','リサーチ統括部 総合調査グループにリサーチャーとして配属され、日本国内と海外の各種マーケティング調査を担当',
78,'その他','マーケティング','プロデューサー','2011','2012','リサーチ統括部 総合調査グループにリサーチャーとして配属され、日本国内と海外の各種マーケティング調査を担当',
79,'コーポレート','営業・コンサルタント','リーダー','2012','2013','ドローンを使用した宅配サービスの設置個所のハンティングや、新規参入店舗の獲得',
80,'その他','戦略・経営企画',null,'2013','2014','企画部のミッションは、3年後の成長に向けて、経営課題を構想から実行までドライブすること。三木谷社長やECカンパニー経営陣と経営課題や解決策について議論させて頂き、その実現まで責任を持ってリードしていきます。',
81,'コーポレート','物流・SCM','マネージャー','2014','2015',null,
81,'EC','物流・SCM','ディレクター','2015','2017','数名のECCとテストプロジェクトを立ち上げました。彼らの日常的なタレントマネジメントや仕事の進め方を学び、改善を見込める点についていくつかのアイデアを試しました。',
81,'EC','データサイエンティスト・リサーチャー','ディレクター','2017','2018','リコメンドロジック等のデータサイエンスソリューションの開発に従事',
82,'コーポレート','アプリケーションエンジニア','ディレクター','2015','2016',null,
83,'コーポレート','データサイエンティスト・リサーチャー','プロデューサー','2016','2017','事業部の戦略と照らし合わせながらセグメントに合わせたターゲティングや、リコメンドロジックの開発・改善など最もビジネス価値が高いソリューションを開発し、それを仕組み化するためシステムの実装まで行います。',
84,'コーポレート','その他','リーダー','2010','2018','新規事業における改善策と、社内の業務効率化に取り組んでいました',
85,'FinTech','戦略・経営企画','リーダー','1988','1991','名古屋支店を経て、本店外国為替部配属。後に企業金融開発部で国際的なM&Aの斡旋を担当し、孫正義（ソフトバンク）、増田宗昭（TSUTAYA）などが顧客であった',
85,'コーポレート','戦略・経営企画','CEO','1997','2018','In Rakuten, Mikitani sought to create an e-commerce platform characterized by Empowerment and Omotenashi.'


]; 

 

 

// 8をカラム数に変更 

        $i = 0; 

        $data[7*$i+0]; //user_id  

        $data[7*$i+1]; //service 

        $data[7*$i+2]; // career 

        $data[7*$i+3]; // position 

        $data[7*$i+4]; // start 

        $data[7*$i+5]; // end 

        $data[7*$i+6]; // project detail         

         

        for($i=0; $i<120; $i++) { 

            DB::table('user_careers')->insert([ 

                'user_id' => $data[7*$i+0], 

                'service' => $data[7*$i+1], 

                'career' => $data[7*$i+2], 

                'position' => $data[7*$i+3], 

                'start' => $data[7*$i+4], 

                'end' => $data[7*$i+5], 

                'project_detail' => $data[7*$i+6], 

                ]); 
        }

    } 
}
